#[test]

/*

/* Fill in the blanks */
fn main() {
    let v = 3.1415926;

    println!("{:.1$}", v, 4); // same as {:.4} => 3.1416

    assert_eq!(format!("__", v), "3.14");
    assert_eq!(format!("__", v), "+3.14");
    assert_eq!(format!("__", v), "3");

    println!("Success!");
}
*/

fn main() {
    let v = 3.1415926;

    println!("{:.1$}", v, 4); // same as {:.4} => 3.1416

    assert_eq!(format!("{:.2}", v), "3.14");
    assert_eq!(format!("{:+.2}", v), "+3.14");
    assert_eq!(format!("{:.0}", v), "3");

    println!("Success!");
}


/*
"{:.2}" — округлює число до 2 знаків після коми, отже результат "3.14".
"{:+.2}" — округлює до 2 знаків після коми і додає знак + для позитивного числа, результат " +3.14".
"{:.0}" — округлює число до 0 знаків після коми, отже результат "3".
*/